[
    {
        "turkish": "Kedi, vahşi bir hayvana göre biraz evcilleşmiş görünüyordu. (seem, a little, tame)",
        "english": "The cat seemed a little tame for a wild animal."
    },
    {
        "turkish": "Yaklaşan sınav hakkında oldukça endişeli bir şekilde konuştu. (speak, rather, worriedly)",
        "english": "She spoke rather worriedly about the upcoming exam."
    },
    {
        "turkish": "Hava o kadar berbattı ki dışarı çıkamadık. (be, so, terrible)",
        "english": "The weather was so terrible that we couldn’t go outside."
    },
    {
        "turkish": "Kötü hizmet hakkında çok yüksek sesle şikayet etti. (complain, very, loudly)",
        "english": "He complained very loudly about the poor service."
    },
    {
        "turkish": "Belgesel gerçekten ilginç ve bilgilendiriciydi. (be, really, documentary)",
        "english": "The documentary was really interesting and informative."
    },
    {
        "turkish": "Devrim ülkenin geleceğini çok hızlı bir şekilde değiştirdi. (change, too, revolution)",
        "english": "The revolution changed the country's future too quickly."
    },
    {
        "turkish": "Talimatlar son derece karmaşıktı. (be, extremely, complicated)",
        "english": "The instructions were extremely complicated to follow."
    },
    {
        "turkish": "Davranışı o kadar rahatsız ediciydi ki onu rapor etmek zorunda kaldık. (be, so, harassing)",
        "english": "His behavior was so harassing that we had to report him."
    },
    {
        "turkish": "Hata yaptıktan sonra çok içten bir şekilde özür diledi. (apologize, very, sincerely)",
        "english": "She apologized very sincerely after the mistake."
    },
    {
        "turkish": "Çok hızlı bir şekilde benim suçlu olduğumu varsaydı. (assume, really, quickly)",
        "english": "He assumed really quickly that I was guilty."
    },
    {
        "turkish": "Bu yıl sayısız projeye dahil oldu. (involved, numerous, projects)",
        "english": "She was involved in numerous projects this year."
    },
    {
        "turkish": "Birçok insan etkinliğe katılmak için istekli. (participate, eager, participate)",
        "english": "Many people are eager to participate in the event."
    },
    {
        "turkish": "Kış aylarında içerisi çok soğuktu. (be, too, indoors)",
        "english": "It was too cold indoors during the winter."
    },
    {
        "turkish": "Tavan sızıntıdan dolayı çok yavaş bir şekilde damlıyordu. (drip, very, slowly)",
        "english": "The ceiling dripped very slowly due to the leak."
    },
    {
        "turkish": "Yağmurdan sonra zemin o kadar kaygandı ki. (be, so, slippery)",
        "english": "The floor was so slippery after the rain."
    },
    {
        "turkish": "Aile, sağlanan barınma için son derece minnettardı. (grateful, extremely, sheltering)",
        "english": "The family was extremely grateful for the sheltering provided."
    },
    {
        "turkish": "Çatıdaki sızıntı gerçekten zor tamir edildi. (fix, really, leak)",
        "english": "The roof leak was really hard to fix."
    },
    {
        "turkish": "Vazoyu kazara devirdi. (knock over, accidentally, vase)",
        "english": "He accidentally knocked over the vase."
    },
    {
        "turkish": "Kırık cam dokunulamayacak kadar tehlikeliydi. (be, too, hazardous)",
        "english": "The broken glass was too hazardous to touch."
    },
    {
        "turkish": "Mazeretleri o kadar zavallıydı ki kimse ona inanmadı. (be, so, pathetic)",
        "english": "His excuses were so pathetic that no one believed him."
    },
    {
        "turkish": "Anlaşmaya varmak için gerçekten sıkı pazarlık ettiler. (negotiate, really, hard)",
        "english": "They negotiated really hard to reach an agreement."
    },
    {
        "turkish": "Hırsızlar evde oldukça sakin bir şekilde ilerledi. (move, rather, steadily)",
        "english": "The burglars moved rather steadily through the house."
    },
    {
        "turkish": "Fırtınadan sonra kıyafetlerim sırılsıklamdı. (be, soaking, wet)",
        "english": "My clothes were soaking wet after the storm."
    },
    {
        "turkish": "Soruyu cevaplamadan önce biraz düşündü. (ponder, a little, while)",
        "english": "He pondered for a little while before answering the question."
    },
    {
        "turkish": "Kedi, keskin pençeleriyle mobilyayı tırmaladı. (scratch, sharp, claws)",
        "english": "The cat scratched the furniture with its sharp claws."
    },
    {
        "turkish": "Kuş pencereye çok sert bir şekilde gagaladı. (peck, too, hard)",
        "english": "The bird pecked too hard at the window."
    },
    {
        "turkish": "Yüksek gürültü beni işimden çok fazla dikkatimi dağıttı. (distract, very, much)",
        "english": "The loud noise distracted me very much from my work."
    },
    {
        "turkish": "Yardımınız için son derece minnettarım. (grateful, extremely, help)",
        "english": "I am extremely grateful for your help."
    },
    {
        "turkish": "Sonuçlardan o kadar hayal kırıklığına uğradı ki. (be, so, disappointed)",
        "english": "He was so disappointed with the results."
    },
    {
        "turkish": "Alnındaki teri gerçekten hızlı bir şekilde sildi. (wipe, really, quickly)",
        "english": "He wiped the sweat off his forehead really quickly."
    },
    {
        "turkish": "Üst rafa ulaşmak için merdiven çok kullanışlıydı. (be, very, useful)",
        "english": "The stepladder was very useful for reaching the top shelf."
    },
    {
        "turkish": "Köpek yemek artıklarını oldukça hızlı bir şekilde yedi. (eat, rather, quickly)",
        "english": "The dog ate the food scraps rather quickly."
    },
    {
        "turkish": "Vahşi hayvan hiç evcil değildi. (be, at all, tame)",
        "english": "The wild animal wasn't tame at all."
    },
    {
        "turkish": "Hatası için çok geç özür diledi. (apologize, too, late)",
        "english": "He apologized too late for his mistake."
    },
    {
        "turkish": "Hırsızlar eve gerçekten sessizce girdiler. (enter, really, quietly)",
        "english": "The burglars entered the house really quietly."
    },
    {
        "turkish": "Tavan suyu o kadar sabit bir şekilde damlatıyordu ki. (drip, so, steadily)",
        "english": "The ceiling was dripping water so steadily."
    }
]
